
def area(a):
    '''
    Назначение: Вычисляет площадь квадрата.
    Аргумент: a — длина стороны квадрата.
    Формула: Площадь квадрата рассчитывается по формуле a*a, где a - сторона квадрата.
    Возвращаемое значение: Функция возвращает значение площади квадрата.
    '''
    return a * a


def perimeter(a):
    '''
    Назначение: Вычисляет периметр квадрата.
    Аргумент: a — длина стороны квадрата.
    Формула: Периметр квадрата рассчитывается по формуле 4*а, т.к стороны все равны.
    Возвращаемое значение: Функция возвращает значение периметра квадрата.
    '''
    return 4 * a
